app/controllers/api/v1/tags_controller.rb

    def index
      render json: Tag.all
---
SELECT "tags".* FROM "tags"