app/controllers/api/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT "tags".* FROM "tags" INNER JOIN "tags_tasks" ON "tags"."id" = "tags_tasks"."tag_id" WHERE "tags_tasks"."task_id" = $1  [["task_id", 1]]
---
    def index
      @tasks = Task.all

      tagtasks = []

      @tasks.each do |task|
        tagnames = []
        task.tags.each do |tag|

INSERT INTO "tags_tasks" ("task_id", "tag_id") VALUES ($1, $2)  [["task_id", 6], ["tag_id", 2]]
INSERT INTO "tasks" ("name", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Tesois"], ["done", false], ["created_at", "2020-02-08 10:29:25.450046"], ["updated_at", "2020-02-08 10:29:25.450046"]]
---
      task = Task.create(task_params)

DELETE FROM "tags_tasks" WHERE "tags_tasks"."task_id" = $1  [["task_id", 6]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 6]]
---
    def destroy
      Task.destroy(params[:id])